In [1]:
# importando la libreria pandas

import pandas as pd

In [2]:
"""
las series son arreglos unidimencionales como las listas o los arrays
pero se pueden generar por id etiquetas
"""

serie = pd.Series([1,2,4,5,6])

In [3]:
serie

0    1
1    2
2    4
3    5
4    6
dtype: int64

In [4]:
# ejemplo creando serie con etiquetas
serie = pd.Series([1,2,4,5,6], index = ['a', 'b', 'c', 'd', 'e'])

In [5]:
serie

a    1
b    2
c    4
d    5
e    6
dtype: int64

In [6]:
# creando series a partir de diccionarios

diccionario = {'a':5, 'b':6 ,'c':89, 'd':97}

serie1 = pd.Series(diccionario)

In [7]:
serie1

a     5
b     6
c    89
d    97
dtype: int64

In [8]:
# obtener el valor de una serie pasando el valor de la etiqueta

serie1['a']

5

In [9]:
# obtener el valor de una serie pasando el valor de la posicion

serie1[3]

97

In [10]:
# obtener los valores de una serie pasando un rango de valores

serie1[2:]

c    89
d    97
dtype: int64

In [11]:
# devulve las etiquetas asignadas a una serie

serie1.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [12]:
# devulve los valores asignados a una serie

serie1.values

array([ 5,  6, 89, 97], dtype=int64)

In [13]:
# realizar operaciones con series se debe tener cuidado que tengan las mismas etiquetas

# suma de series

serie = pd.Series([1,2,4,5,6], index = ['a', 'b', 'c', 'd', 'e'])

diccionario = {'a':5, 'b':6 ,'c':89, 'd':97, 'e':15}

serie1 = pd.Series(diccionario)

resultado = serie + serie1

In [14]:
resultado

a      6
b      8
c     93
d    102
e     21
dtype: int64

In [15]:
# multiplicar todos los elementos de una serie por un valor

serie1*10

a     50
b     60
c    890
d    970
e    150
dtype: int64

In [16]:
# utilizar las opciones de numpy 
import numpy as np

In [17]:
# raiz cuadrada de la serie1
np.sqrt(serie1)

a    2.236068
b    2.449490
c    9.433981
d    9.848858
e    3.872983
dtype: float64

In [18]:
"""

Crear un dataframe es una estructura bidimencional muy parecidas a las tablas

"""

# se crea un diccionario con dos columnas se series

dic1 = {'columna1': pd.Series([1,2,4,5,6], index = ['a', 'b', 'c', 'd', 'e']),'columna2': pd.Series([8,9,10,11,12], index = ['a', 'b', 'c', 'd', 'e'])}

In [19]:
# se crea el dataframe a partir del diccionario

dataframe = pd.DataFrame(dic1)

In [20]:
dataframe

   columna1  columna2
a         1         8
b         2         9
c         4        10
d         5        11
e         6        12

In [21]:
# crear un dataframe a partir de una lista con diccionarios

lista = [{'a':1, 'b':5, 'c':7}, {'c':1, 'h':5, 'b':7}]

dataframe1 = pd.DataFrame(lista)

In [22]:
dataframe1

     a  b  c    h
0  1.0  5  7  NaN
1  NaN  7  1  5.0

In [23]:
# consultar una columna en concreto con un dataframe

dataframe1['b']

0    5
1    7
Name: b, dtype: int64

In [24]:
# agregar columnas a un dataframe

dataframe1['t'] = pd.Series([5,2], index = [0,1])

In [25]:
dataframe1

     a  b  c    h  t
0  1.0  5  7  NaN  5
1  NaN  7  1  5.0  2

In [26]:
# añadir columna al primer frame
dataframe['columna3'] = pd.Series([1,2,4,5,6], index = ['a', 'b', 'c', 'd', 'e'])

In [27]:
dataframe

   columna1  columna2  columna3
a         1         8         1
b         2         9         2
c         4        10         4
d         5        11         5
e         6        12         6

In [28]:
# eliminar una columna del dataframe

del dataframe['columna1']

In [29]:
dataframe

   columna2  columna3
a         8         1
b         9         2
c        10         4
d        11         5
e        12         6

In [30]:
# acceder a valores de una fila de un dataframe

dataframe.loc['b']

columna2    9
columna3    2
Name: b, dtype: int64

In [31]:
# acceder a valores de una fila por posicion de un dataframe

dataframe.iloc[1]

columna2    9
columna3    2
Name: b, dtype: int64

In [32]:
# seleccion de filas por array booleano

filtro = np.array([True, False, True, False, True])

In [33]:
dataframe[filtro]

   columna2  columna3
a         8         1
c        10         4
e        12         6

In [34]:
# realizar la transpuesta de un dataframe

dataframe.T

          a  b   c   d   e
columna2  8  9  10  11  12
columna3  1  2   4   5   6

In [35]:
# gestion de datos 

diccionario = {'user3': pd.Series(['Juan', 'Barcelona', 32, 'Soltero', 'Hombre'], index = ['nombre', 'localidad', 'edad','estado civil', 'sexo']),
               'user4': pd.Series(['Alicia', 'Santander', 47, 'Casado', 'Mujer'] , index = ['nombre', 'localidad', 'edad','estado civil', 'sexo']),
               'user2': pd.Series(['Marcos', 'Madrid', 31, 'Casado', 'Hombre'] , index = ['nombre', 'localidad', 'edad','estado civil', 'sexo']),
               'user1': pd.Series(['Isabel', 'Zaragoza', 70, 'Soltero', 'Mujer'] , index = ['nombre', 'localidad', 'edad','estado civil', 'sexo'])}

datframe = pd.DataFrame(diccionario).T
datframe

       nombre  localidad edad estado civil    sexo
user3    Juan  Barcelona   32      Soltero  Hombre
user4  Alicia  Santander   47       Casado   Mujer
user2  Marcos     Madrid   31       Casado  Hombre
user1  Isabel   Zaragoza   70      Soltero   Mujer

In [36]:
# ordenar filas por un valor

datframe.sort_values(by = "edad")

       nombre  localidad edad estado civil    sexo
user2  Marcos     Madrid   31       Casado  Hombre
user3    Juan  Barcelona   32      Soltero  Hombre
user4  Alicia  Santander   47       Casado   Mujer
user1  Isabel   Zaragoza   70      Soltero   Mujer

In [37]:
# ordenar filas por un dato de forma acendente o decendente

datframe.sort_values(by = "nombre", ascending = False)

       nombre  localidad edad estado civil    sexo
user2  Marcos     Madrid   31       Casado  Hombre
user3    Juan  Barcelona   32      Soltero  Hombre
user1  Isabel   Zaragoza   70      Soltero   Mujer
user4  Alicia  Santander   47       Casado   Mujer

In [38]:
# agrupar por valores

datframe.groupby(by = "estado civil").count()

              nombre  localidad  edad  sexo
estado civil
Casado             2          2     2     2
Soltero            2          2     2     2

In [39]:
# generar funciones anonimas para una fila de un dataframe

datframe.apply(lambda item: item['edad'] < 35 and item['estado civil'] == 'Soltero', axis= 1)

user3     True
user4    False
user2    False
user1    False
dtype: bool

In [40]:
# funciones estadisticas de los dataframes

# obtiene algunas descripciones del dataframe

datframe.describe()

       nombre  localidad  edad estado civil    sexo
count       4          4     4            4       4
unique      4          4     4            2       2
top      Juan  Barcelona    32      Soltero  Hombre
freq        1          1     1            2       2

In [41]:
# leer archivos .csv y convertirlo en dataframe

pd.read_csv("movies.csv")

,Film,Genre,Lead Studio,Audience score %,Profitability,Rotten Tomatoes %,Worldwide Gross,Year
0,Zack and Miri Make a Porno,Romance,The Weinstein Company,70,1.747542,64,$41.94,2008
1,Youth in Revolt,Comedy,The Weinstein Company,52,1.090000,68,$19.62,2010
2,You Will Meet a Tall Dark Stranger,Comedy,Independent,35,1.211818,43,$26.66,2010
3,When in Rome,Comedy,Disney,44,0.000000,15,$43.04,2010
4,What Happens in Vegas,Comedy,Fox,72,6.267647,28,$219.37,2008
...,...,...,...,...,...,...,...,...
72,Across the Universe,romance,Independent,84,0.652603,54,$29.37,2007
73,A Serious Man,Drama,Universal,64,4.382857,89,$30.68,2009
74,A Dangerous Method,Drama,Independent,89,0.448645,79,$8.97,2011
75,27 Dresses,Comedy,Fox,71,5.343622,40,$160.31,2008
76,(500) Days of Summer,comedy,Fox,81,8.096000,87,$60.72,2009

In [42]:
# generar archivo csv apartir de un dataframe

dataframe.to_csv("mi_csv.csv")